[
  "Adroit Grow Private Limited",
  "All Industrial Projects",
  "Our Specialization",
  "Our Pride",
  "SEMICON SPECILITY AIR GASES – GHILOTH",
  "HELIOUS SPECIALTY GASES – HYDERABAD",
  "HELIOUS SPECIALTY GASES – GHILOTH",
  "TEGAMAN SAFETY PRODUCTS – GHILOTH",
  "GRINDLAYS ENGINE PARTS – GHILOTH",
  "SACHDEVA POLYCOLOR (RANG MAHAL)- MET RELIANCE",
  "ULTIMA MESA – NEEMRANA",
  "TRANS ACNR SOLUTIONS – GHILOTH",
  "SCOTT SPARES &amp; AUTOMOBILES PARTS – GHILOTH",
  "JMD SCIENTIFIC EQUIPMENT – MET RELIANCE (JHAJJAR)",
  "Solution",
  "Industries",
  "Quick Links",
  "Office Location",
  "EMPOWERING GROWTH WITH PROFESSIONALS",
  "About US",
  "Enquiry Now",
  "\"Specialized in Industrial greenfield projects from Concept Design to Productive stage\"",
  "Adroit Grow Private Limited founded by Mr. Manish Bhatnagar, a Civil Engineer with vast experience of 20+ years executing Industrial, Commercial &amp; Interior Spaces. In his career, He has executed 150+ projects successfully with more than 70 Industrial projects in IMT Manesar itself. With a deep knowledge of technical know-how of Civil, HVAC, Plumbing, Electrical, Solar, PEB Structures and farsightedness, he is an expert of Project Management of handling multiple projects at a time.",
  "We are specialized in below mentioned fields :",
  "Name*",
  "Contact Number*",
  "Email Id*",
  "Message*",
  "Email : manish.bhatnagar@adroitgrow.com",
  "Web : www.adroitgrow.com",
  "Contact : 9810324201",
  "851 Sector 15 Part-II Basement Gurugram 122001",
  "All Right Reserved 2023-2024",
  "Developed &amp; Promoted by:Acil Technologies Pvt Ltd",
  "About Us",
  "Services",
  "Projects Industrial Architectural &amp; Engineering Design HELIOUS SPECIALTY GASES – GHILOTH HELIOUS SPECIALTY GASES PVT.LTD. – HYDERABAD UNIQUE BIMETAL – GHILOTH GRINDLAYS ENGINE PARTS – GHILOTH AJAY AIR PRODUCTS – IMT FARIDABAD AMPLE AUTO TECH – IMT MANESAR SACHDEVA POLYCOLOR RANG MAHAL – MET RELIANCE TEGAMAN SAFETY PRODUCTS PVT. LTD. – GHILOTH SEMICON SPECIALTY GASES PVT. LTD. – GHILOTH SCOTT SPARES &amp; AUTOMOBILES PARTS – GHILOTH TRANS ACNR SOLUTIONS PVT. LTD. – GHILOTH JMD SCIENTIFIC EQUIPMENT PVT.LTD. – MET RELIANCE (JHAJJAR) JAKSON &amp; COMPANY – KAROLI (RAJASTHAN) ULTIMA MESA PVT.LTD. – NEEMRANA OFFICE INTERIOR STAR SPECIALTY GASES – IMT MANESAR DLF CORPORATE GREEN- GURUGRAM MAX BROS VENTURES UNIT – 1 , MANESAR MAX BROS VENTURES UNIT -3 , MANESAR OLYMPUS EROS CORPORATE SONEPAR HELIOUS SPECIALTY GASES PVT. LTD. – GHILOTH HELIOUS SPECIALTY GASES PVT.LTD. – HYDERABAD DESIGN &amp; BUILD DLF CORPORATE GREEN- GURUGRAM MAX BROS VENTURES UNIT – 1 , MANESAR MAX BROS VENTURES UNIT -3 , MANESAR OLYMPUS SONEPAR PROJECT MANAGEMENT HELIOUS SPECIALTY GASES – GHILOTH HELIOUS SPECIALTY GASES PVT. LTD. – HYDERABAD JAKSON &amp; COMPANY – KAROLI (RAJASTHAN) SACHDEVA POLYCOLOR RANG MAHAL – MET RELIANCE SEMICON SPECIALTY GASES PVT. LTD. – GHILOTH JMD SCIENTIFIC EQUIPMENT PVT.LTD. – MET RELIANCE (JHAJJAR)",
  "Industrial Architectural &amp; Engineering Design HELIOUS SPECIALTY GASES – GHILOTH HELIOUS SPECIALTY GASES PVT.LTD. – HYDERABAD UNIQUE BIMETAL – GHILOTH GRINDLAYS ENGINE PARTS – GHILOTH AJAY AIR PRODUCTS – IMT FARIDABAD AMPLE AUTO TECH – IMT MANESAR SACHDEVA POLYCOLOR RANG MAHAL – MET RELIANCE TEGAMAN SAFETY PRODUCTS PVT. LTD. – GHILOTH SEMICON SPECIALTY GASES PVT. LTD. – GHILOTH SCOTT SPARES &amp; AUTOMOBILES PARTS – GHILOTH TRANS ACNR SOLUTIONS PVT. LTD. – GHILOTH JMD SCIENTIFIC EQUIPMENT PVT.LTD. – MET RELIANCE (JHAJJAR) JAKSON &amp; COMPANY – KAROLI (RAJASTHAN) ULTIMA MESA PVT.LTD. – NEEMRANA",
  "HELIOUS SPECIALTY GASES PVT.LTD. – HYDERABAD",
  "UNIQUE BIMETAL – GHILOTH",
  "AJAY AIR PRODUCTS – IMT FARIDABAD",
  "AMPLE AUTO TECH – IMT MANESAR",
  "SACHDEVA POLYCOLOR RANG MAHAL – MET RELIANCE",
  "TEGAMAN SAFETY PRODUCTS PVT. LTD. – GHILOTH",
  "SEMICON SPECIALTY GASES PVT. LTD. – GHILOTH",
  "TRANS ACNR SOLUTIONS PVT. LTD. – GHILOTH",
  "JMD SCIENTIFIC EQUIPMENT PVT.LTD. – MET RELIANCE (JHAJJAR)",
  "JAKSON &amp; COMPANY – KAROLI (RAJASTHAN)",
  "ULTIMA MESA PVT.LTD. – NEEMRANA",
  "OFFICE INTERIOR STAR SPECIALTY GASES – IMT MANESAR DLF CORPORATE GREEN- GURUGRAM MAX BROS VENTURES UNIT – 1 , MANESAR MAX BROS VENTURES UNIT -3 , MANESAR OLYMPUS EROS CORPORATE SONEPAR HELIOUS SPECIALTY GASES PVT. LTD. – GHILOTH HELIOUS SPECIALTY GASES PVT.LTD. – HYDERABAD",
  "STAR SPECIALTY GASES – IMT MANESAR",
  "DLF CORPORATE GREEN- GURUGRAM",
  "MAX BROS VENTURES UNIT – 1 , MANESAR",
  "MAX BROS VENTURES UNIT -3 , MANESAR",
  "OLYMPUS",
  "EROS CORPORATE",
  "SONEPAR",
  "HELIOUS SPECIALTY GASES PVT. LTD. – GHILOTH",
  "DESIGN &amp; BUILD DLF CORPORATE GREEN- GURUGRAM MAX BROS VENTURES UNIT – 1 , MANESAR MAX BROS VENTURES UNIT -3 , MANESAR OLYMPUS SONEPAR",
  "PROJECT MANAGEMENT HELIOUS SPECIALTY GASES – GHILOTH HELIOUS SPECIALTY GASES PVT. LTD. – HYDERABAD JAKSON &amp; COMPANY – KAROLI (RAJASTHAN) SACHDEVA POLYCOLOR RANG MAHAL – MET RELIANCE SEMICON SPECIALTY GASES PVT. LTD. – GHILOTH JMD SCIENTIFIC EQUIPMENT PVT.LTD. – MET RELIANCE (JHAJJAR)",
  "HELIOUS SPECIALTY GASES PVT. LTD. – HYDERABAD",
  "Contact",
  "Industrial Architectural &amp; Engineering Design : we are specialized in designing and planning of industrial buildings or infrastructure. When it comes to planning, we have to ensure quality standards to make sure it is safely built for production or human use. Industrial architects are responsible for the design and planning of the following: warehouses, factories ,processing plants and much more.",
  "Project Management : Project management is the process of leading the work of a team to achieve all project goals within given constraints. This information is usually described in the project documentation created at the beginning of the development process. The primary constraints are scope, time and budget. We manage and provide consultancy for all aspects of the company's industrial architectural design.",
  "Interior Design : Interior design is a multifaceted profession that involves conceptual development, space planning, site inspection, programming, research, communication with a project's stakeholders, construction management and design execution and we undertake corporate and industrial interior design.",
  "INDUSTRIAL ARCHITECTURAL &amp; ENGINEERING DESIGN",
  "PROJECT MANAGEMENT",
  "OFFICE INTERIOR",
  "Projects",
  "Grow Private Limited",
  "Adroit Grow",
  "Email :",
  "Web :",
  "Contact :",
  "Industrial Architectural &amp; Engineering Design :",
  "Project Management :",
  "Interior Design",
  "Where we’ve built",
  "Adroit Grow Private limited founded by Mr. Manish Bhatnagar, a Civil Engineer with vast experience of 20+ years executing Industrial, Commercial &amp; Interior Spaces. In his career, He has executed 150+ projects successfully with more than 70 Industrial projects in IMT Manesar itself. With a deep knowledge of technical know-how of Civil, HVAC, Plumbing, Electrical, Solar, PEB Structures and farsightedness, he is an expert of Project Management of handling multiple projects at a time. He has done projects for a mix of clients including Japanese Multinationals, Indian Conglomerates, SMEs, Automobile ancillaries, Garment manufacturing Units, Plastic Injection Molding Factories, Engineering Industries and specialized in the Tire Industry. Passionate about his work and each site, Energetic, People- Centric, his experience and insights are taking Adroit Grow to newer heights.",
  "Adroit Grow provides a single window one-stop solution to their customer with an emphasis on cost control &amp; value additions by utilizing current Technologies &amp; hands-on industrial experience.",
  "“Specialized in Industrial greenfield projects from Concept Design to Productive stage”",
  "SERVICES",
  "What We Offer",
  "Industrial Architectural &amp; Engineering Design",
  "DESIGN &amp; BUILD",
  "With over 30 year experience, The steel team can help you with whatever your need may be. I you simply require one steel or you are building a block of flats. The steel team is the right place to come.",
  "Industrial Architectural &amp; Engineering Design Liasioning with the Local Authority for Permission and Approval Design Development Construction Documents Bidding and Negotiation Budgeting &amp; Estimation Bill Verification 3D Design Pre Engineering Building Design RCC Building Design Fire Fighting Design Sanitary &amp; Plumbing Design Electrical Design Vastu Implementation As Build Drawing Green Building Design",
  "Liasioning with the Local Authority for Permission and Approval",
  "Design Development",
  "Construction Documents",
  "Bidding and Negotiation",
  "Budgeting &amp; Estimation",
  "Bill Verification",
  "3D Design",
  "Pre Engineering Building Design",
  "RCC Building Design",
  "Fire Fighting Design",
  "Sanitary &amp; Plumbing Design",
  "Electrical Design",
  "Vastu Implementation",
  "As Build Drawing",
  "Green Building Design",
  "PROJECT MANAGEMENT Schematic Design and Planning Inputs, Master Project Planning &amp; Scheduling Contract Administration. Appropriate Technology &amp; General Contractor Selection Statutory Approvals. Cost Estimation Control &amp; Site Supervision Control Testing and Commissioning Tender Documents Negotiation Machine Installation Support Test Trial to Final Production Support",
  "Schematic Design and Planning Inputs, Master Project Planning &amp; Scheduling Contract Administration.",
  "Appropriate Technology &amp; General Contractor Selection Statutory Approvals.",
  "Cost Estimation Control &amp; Site Supervision Control",
  "Testing and Commissioning",
  "Tender Documents Negotiation",
  "Machine Installation Support",
  "Test Trial to Final Production Support",
  "OFFICE INTERIOR Concept and Design Layouts of Interior Space Planning Project Management Cost Estimating Fit-out and Construction 3D Design Civil, Structural, Mechanical, Electrical Networking HVAC etc. Execution Furniture Design Health and Safety Compliance As Build Drawing, Operation Manual Training",
  "Concept and Design Layouts of Interior",
  "Space Planning",
  "Project Management",
  "Cost Estimating",
  "Fit-out and Construction",
  "Civil, Structural, Mechanical, Electrical Networking HVAC etc.",
  "Execution",
  "Furniture Design",
  "Health and Safety Compliance",
  "As Build Drawing,",
  "Operation Manual Training",
  "DESIGN &amp; BUILD Licensing with the Local Authority for Permission and Approval Geo Technical Investigation by Affiliated Special List Contract Administration Appropriate Technology and General Contractor Selection Detail Survey Manual Training",
  "Licensing with the Local Authority for Permission and Approval",
  "Geo Technical Investigation by Affiliated Special List",
  "Contract Administration",
  "Appropriate Technology and General Contractor Selection",
  "Detail Survey",
  "Manual Training",
  "Company Projects",
  "Liasioning with the Local Authority for Permission and Approval Design Development Construction Documents Bidding and Negotiation Budgeting &amp; Estimation Bill Verification 3D Design Pre Engineering Building Design RCC Building Design Fire Fighting Design Sanitary &amp; Plumbing Design Electrical Design Vastu Implementation As Build Drawing Green Building Design",
  "Helios Specialty Gases Pvt. Ltd is an industrial and specialty gases importer, manufacturer, and distributor in India. Deals into Pure gases, Rare Gases, Helium, Calibration Gas Standards, Specialty Gases, Hydrocarbons, Gas Cylinders, Gas Regulators, and Gas Handling Equipment sourced from globally renowned companies.",
  "Plot Area: 5 Acre (20000 sqm)",
  "Type of Building: PEB Building",
  "Covered Area: Phase-1/6000 sqm",
  "Location: Ghiloth Industrial Area (Rajasthan)",
  "Year: 2021-2022",
  "Scope of Work: Design &amp; Project Management",
  "Status: Complete",
  "Plot Area",
  "Type of Building",
  "Covered Area",
  "Location",
  "Scope of Work",
  "Status",
  "Helious Specialty Gases Pvt. Ltd. is an industrial and specialty gases importer, manufacturer, and distributor in India. Deals into Pure gases, Rare Gases, Helium, Calibration Gas Standards, Specialty Gases, Hydrocarbons, Gas Cylinders, Gas Regulators, and Gas Handling Equipment sourced from globally renowned companies.",
  "Plot Area: 6176 sqmtr",
  "Type of Building : PEB Building",
  "Covered Area: 20000 sqmtr",
  "Location: Jadcherla , Hyderabad",
  "Year: 2022",
  "Scope of Work: Design &amp; supervision",
  "Type of Building :",
  "Status:",
  "Unique Bimetals is a professional Manufacturer &amp; Supplier of different metal powder in different particle sizes. We offer a wide array of Bi-Metal Strips and Copper Alloy Powder for different applications.",
  "Plot Area: 4000 sqmtr",
  "Covered Area: 37660 sqft (3500 smtr)",
  "Location: Ghiloth (Rajasthan)",
  "Scope of Work: Design Consultancy",
  "Status: Running",
  "Grind Tech Engines Pvt Ltd. is is a certified manufacturer of high performance engine parts in India with a strong presence in the international market as well. There is a wide range of products such as Liner and Sleeves, Piston , Piston Rings, Piston Pins, Cylinder Blocks, Engine Valves, Valves Seat Inserts, Valves Guide,Bimetallic Bushes and Bearing. This Company supplies to various Automobile and Industrial Companies Manufacturing Engines and Engine Parts in the European Market, the US Market &amp; the Asian Market.",
  "Plot Area: 2 Acre (8000 sqmtr)",
  "Covered Area: 6000 sqmtr",
  "Year: Jan 2022",
  "Ajay air a leading industrial and specialty gas importer, manufacturer, and distributor in India. Deal in Pure gases, Rare Gases, Calibration Gas Standards, Specialty Gases, Hydrocarbons, Bulk Cryogenic Liquids, Gas Cylinders, Gas Regulators and Gas Handling Equipment sourced from globally renowned companies",
  "Plot Area: 1800 sqmtr",
  "Covered Area: 2160 sqmtr",
  "Location: IMT Faridabad ( Haryana )",
  "Year: 2020",
  "Scope of Work: Design &amp; Consultancy",
  "Ample Auto Tech Pvt Ltd is a leading Manufacturer and Exporter of Steering &amp; Suspension Parts in India. Their products are applicable to all segments of the automobile industry ranging from commercial vehicles, heavy duty vehicles, passenger vehicles, agricultural vehicles etc.",
  "Plot Area: 4050 sqmtr",
  "Type of Building : RCC Building",
  "Covered Area: 6000 smtr",
  "Location: IMT Manesar",
  "Year: 2023",
  "SACHDEVA POLYCOLOR (RANG MAHAL) – MET RELIANCE",
  "SACHDEVA INDUSTRIES unit coloring plastic raw materials. Seeing an increasing demand for master batches, the company diversified into the field of color &amp; additive master batches under the brand name RANG MAHAL.",
  "Plot Area: 3 Acre (12000 sqmtr)",
  "Covered Area: 8000 sqmtr",
  "Location: MET Reliance ( Footwear Park )",
  "TEGAMAN Safety Products Pvt. Ltd. Manufacturer of safety gloves set up a plant with the collaboration of an American company in Ghiloth industrial area.",
  "Plot Area: 2.81 Acre (11395 sqmtr)",
  "Covered Area: 9000 sqmtr",
  "Year : Dec 2020",
  "SEMICON SPECIALTY GASES – GHILOTH",
  "Semicon Specialty Gases Pvt. Ltd is an industrial and specialty gases importer, manufacturer, and distributor in India. Deals into Pure gases, Rare Gases, Helium, Calibration Gas Standards, Specialty Gases, Hydrocarbons, Gas Cylinders, Gas Regulators, and Gas Handling Equipment sourced from globally renowned companies.",
  "Plot Area: 5 Acre (20000 sqmtr)",
  "Covered Area: Phase - 1/2500 sqmtr",
  "Location: Ghiloth Industrial Area ( Rajastha )",
  "Scope of Work: Design &amp; Project Management Consultancy",
  "Year: 2021",
  "TRANS ACNR Solutions Pvt Ltd strives to maintain and further market leadership in Bus Air-Conditioning and Transport Refrigeration systems, through efficient use of quality management system and technological advancements.",
  "Manufacturing and delivering machines that provide the most effective and efficient temperature control, using minimal energy, Trans ACNR respects the environment that our world thrives upon.",
  "Plot Area: 13.00 Acre (52000 sqm)",
  "Covered Area: 31590 sqm",
  "Year: Aug-2022",
  "JMD Scientific Equipment Pvt Ltd is headquartered in Gurgaon, Haryana and is leading manufacturer, supplier and exporter of Physics, Chemistry and General Lab Equipment. Having fully equipped Tool Room for making all types of Sheet metal and Plastic tools with Injection molding facility.",
  "Plot Area: 1 Acre ( 4000 sqmtr)",
  "Covered Area: 3000 sqmtr",
  "Location: MET Reliance (Jhajjar)",
  "Scope of Work: Design Consultancy &amp; Project Management",
  "JAKSON &amp; COMPANY (JAKPOWER) is in the manufacturing of Electric Generator Set, Kirloskar Power Generators, and Control Panels.",
  "Plot Area: 17 Acre (68000 sqmtr)",
  "Covered Area: 32000 sqmtr",
  "Location: Karoli Industrial Area ( Rajasthan )",
  "Scope of Work: Project Management",
  "Ultima Mesa is a Private Limited Indian Non-Government Companyis engaged in the business of providing real estate services.",
  "Plot Area: 4000 sqm",
  "Type of Building: PEB building",
  "Year: February 2022",
  "Location: Neemrana",
  "Concept and Design Layouts of Interior Space Planning Project Management Cost Estimating Fit-out and Construction 3D Design Civil, Structural, Mechanical, Electrical Networking HVAC etc. Execution Furniture Design Health and Safety Compliance As Build Drawing, Operation Manual Training",
  "MAX BROS VENTURES UNIT – 1 MANESAR",
  "Licensing with the Local Authority for Permission and Approval Geo Technical Investigation by Affiliated Special List Contract Administration Appropriate Technology and General Contractor Selection Detail Survey Manual Training",
  "Schematic Design and Planning Inputs, Master Project Planning &amp; Scheduling Contract Administration. Appropriate Technology &amp; General Contractor Selection Statutory Approvals. Cost Estimation Control &amp; Site Supervision Control Testing and Commissioning Tender Documents Negotiation Machine Installation Support Test Trial to Final Production Support",
  "Covered Area: 5 Acre ( 20000 smtr)",
  "Scope of Work: Design &amp; supervision Consultancy",
  "Work Experience",
  "Client Testimonials",
  "\" Specialized in Industrial green field / Brown field projects from Concept Design to Product ivestage Working experience of more than 20 Yr with Industrial Architects in Delhi NCR",
  "Get In Contact With Us",
  "First Name*",
  "last Name*",
  "company Name*",
  "Industry*",
  "Phone Number*",
  "Email Address*",
  "How Did You Hear About Us?*",
  "What Can We Help You With?*",
  "Semicon Specialty Gases Pvt. Ltd. is an industrial and specialty gases importer , manufacturer , and distribution India . Deals into Pure gases , Rare Gases Helium ,Celebration Gas Standards , Specialty Gases ,Hydrocarbons , Gas Cylinders , Gas Regulators , and Gas Handling Equipment Sourced from globally renowned companies .",
  "Plot Area: 5 Acre 20000 sqm",
  "Covered Area: Phase 1/2500 sqm",
  "Location: Ghiloth Industrial Area ( Rajasthan)",
  "Covered Are: Phase-1/6000 sqm",
  "Plot Area:",
  "Covered Are:",
  "Scope of Work:",
  "SACHDEVA INDUSTRIES unit coloring plastic raw materials. Seeing an increasing demand for masterbatches, the company diversified into the field of color &amp; additive masterbatches under the brand name RANG MAHAL.",
  "Plot Area: 3.00 Acre (12000 sqmtr)",
  "Location: MET Reliance (Footwear Park)",
  "Scope of Work: Design &amp; Project management",
  "Status : Running",
  "Type of Building:",
  "Status :"
]
